_posts/2023-06-16-Testing.html
---
layout: default
title: Testing 
subtitle: How to deliver code that works
---
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orge5e7f1d">1. Testing</a></li>
<li><a href="#org27b6f7c">2. Unit Tests and Codebase Architecture</a>
<ul>
<li><a href="#org70084d7">2.1. Isolated Slices</a></li>
<li><a href="#org20ec363">2.2. Refactoring for organization, maintainenace, and resuability</a></li>
<li><a href="#orgc2f0bd2">2.3. Additional powers of abstraction</a></li>
</ul>
</li>
<li><a href="#org890c184">3. User Acceptance Tests</a></li>
<li><a href="#org85a6344">4. Contract Testing</a></li>
<li><a href="#orgbb89c54">5. Integration Tests</a></li>
</ul>
</div>
</div>
<div id="outline-container-orge5e7f1d" class="outline-2">
<h2 id="orge5e7f1d"><span class="section-number-2">1.</span> Testing</h2>
<div class="outline-text-2" id="text-1">
<p>
The single most important thing when delivering code is that it works. Testing is the process by which we prove that it works.
</p>

<p>
In the early stages of my career, I tested manually. I executed whatever process I was building in a test environment, and validated the outputs. I spun up web pages, and started clicking buttons. I monitored the goings-on between front-end and back-end with the Chrome Developer tools, and occasionally took a gander at my creations in Internet Explorer (the only browser which ran our universities ERP software. I'm not joking). Eventually, I would become satisfied, or my manager would become so dissastified with my pace of delivery, that I'd call it done. The business units I wrote software for would validate too.
</p>

<p>
I've since learned to think of testing as a pyramid. At the base of the pyramid are Unit Tests. These test small chunks of code in isolated slices.
</p>

<p>
These small chunks of code combine and amount to an application, which must fulfill certain requirements. We validate those requirements at the next level of the pyramid, with User Acceptance Tests. These tests aren't as isolated &#x2013; we let our code run end-to-end &#x2013; but we don't call any downstream services in the process. We stay in a vacuum, and test only the things which we can control.
</p>

<p>
Next are Contract Tests &#x2013; tests which validate that our code adheres to the contract defined in our documentation, and the contracts of the downstream services we consume. These ensure that our contact-points &#x2013; the areas which form the "boundaries" of our application &#x2013; are valid. This means testing the shape of the overall response of our application, and the requests which we send downwstream. Still, we don't call those downstream services, and we don't get called by any one upstream.
</p>

<p>
Finally at the tip of the pyramid are the integration tests. Tests which validate the entire system works from end to end. If we've done robust testing up until this point, these tests will be few in number, but will test critical paths.
</p>

<p>
With all of these bases covered, as engineers we should not stress over whether or not our code is ready (unless of course we wrote lazy usless tests to save time). At that point we do just need to ship our code.
</p>
</div>
</div>

<div id="outline-container-org27b6f7c" class="outline-2">
<h2 id="org27b6f7c"><span class="section-number-2">2.</span> Unit Tests and Codebase Architecture</h2>
<div class="outline-text-2" id="text-2">
<p>
Unit Testing is an un-sung hero of software engineering. I've seen very few jr engineers get it right. Most codebases I've encountered are filled with lazily written do-nothing tests which dumbly satisfy code-coverage software. The best code bases are about 50:50, with a number of key tests which hold the ship together. I, as someone who learned about unit tests two years ago, will prove their value, and how to write them well. This is how I manage to sleep at night.
</p>
</div>
