org/2023-06-16-Testing.org
** Isolated Slices
The key thing to understand is that Unit Tests are intended to test isolated slices of code. They should test a single function, and the test should not ever leave that funcion. This is harder than it sounds. Writing good code means writing code that is intentionally written to be easy to test, and that takes some experience.

Take for example this code:

#+BEGIN_SRC python
CUSTOMERS_DB = [
    {"name": "Jennifer Love Hewitt", "age": 55},
    {"name": "Anthony Hopkins", "age": 34},
    {"name": "Martin Godzilla", "age": 67},
    {"name": "Tony Jabroney", "age": 21}
]

def create_customer_over_50_file():
    customers = CUSTOMERS_DB

    with open('../output/customers_over_50_report.txt', 'w') as writer:
        customers_over_50 = list(filter((lambda customer: customer['age'] > 50), customers))

        for customer in customers_over_50:
            writer.write(f'{customer["name"]}, { customer["age"]}\n')

create_customer_over_50_file()
#+END_SRC

This code accomplishes a fairly common set of tasks:
- Reads data from some data source
- Filters that data based on a business requirement.
- Writes it to an output destination

Regardless of whether or not you're connecting to a database, reading from an API, or streaming that data into a DLQ, the general principles remain. We access data, transform it, and output it.

The above is nicely written. Generally, whomever wrote this function could feel pretty confident that it does what they want based on reading it. For many years, I wrote code just like this, and I would test it by manually reading the output data, and calling it done. Customer over 50 report is ready for prod, boss.

But now comes a new requirement: we must achieve over 80% of the lines of code covered by a unit test in order to ship it.

No problem, you think. We could run this function, and then write another function to validate. Job done, with the following code:

#+BEGIN_SRC python
import os

def validate_customer_over_50_file_exists():
    path = '../output/customers_over_50_report.txt'
    assert os.path.isfile(path), "Path should exist"

def validate_customer_over_50_file():
    with open('../output/customers_over_50_report.txt', 'r') as reader:
        line = reader.readline()
        while line != '':
            record = line.split(',')
            record = [v.strip() for v in record]
            assert int(record[1]) > 50, "Customer should be over 50"

            line=reader.readline()

validate_customer_over_50_file_exists()
validate_customer_over_50_file()
#+END_SRC

In some contexts, I'd see the above and would think... just ship it. It's not awful. It has asserts which make sense at least. In my time at the university, this already exceeds any automated test I'd ever written (none).

But alas, at major software engineering organizations, this doesn't really fly.

Here's where it starts to break down for me:
- Separation of Responsibility / Concerns
  It's hard to detect in this short snippet, but recall there's 3 separate operations going on. There's the input, the business logic, and the output. They're all mixed together. Any of the 3 can evolve at any time. There's times when from a computer architecture perspective, we're leaving the main execution, and we're waiting on I/O processes to complete.
- Maintainability
  Requirements change. One day, you're reading data from an in-memory source, but the next you're fetching it from a microservice. One day, it's customers over 50, the next, it's customers between the ages of 25 and 55 in California. One day, you're writing it to a flat file, but the next you're sending it to an API. In some cases, 100% of this code would be re-written.
  - Reusability
    What if we need a second report. Much of the requirements are the same, but this time we're writing products to a CSV, and filtering by price. In the current design of this code, we would write a second, completely separate but eerily similiar function. And it would need all it's own unit tests.

You get the idea. It's not bad code, it's just not particularly /good/ code either.

So what do we do? We refactor and abstract. This is where unit tests in some ways begin to drive our codebase architecture. When we develop code with unit tests in mind, the code is better organized, more reusable, and easier to maintain. My first boss at my new company once said, "Programming gets fun when you stop coding and start engineering". My eyes rolled all the way back into my head when he said that, but he was right.

