_posts/2023-06-16-Testing.html

<div id="outline-container-org70084d7" class="outline-3">
<h3 id="org70084d7"><span class="section-number-3">2.1.</span> Isolated Slices</h3>
<div class="outline-text-3" id="text-2-1">
<p>
The key thing to understand is that Unit Tests are intended to test isolated slices of code. They should test a single function, and the test should not ever leave that funcion. This is harder than it sounds. Writing good code means writing code that is intentionally written to be easy to test, and that takes some experience.
</p>

<p>
Take for example this code:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #7590db;">CUSTOMERS_DB</span> = <span style="color: #4f97d7;">[</span>
    <span style="color: #bc6ec5;">{</span><span style="color: #2d9574;">"name"</span>: <span style="color: #2d9574;">"Jennifer Love Hewitt"</span>, <span style="color: #2d9574;">"age"</span>: <span style="color: #a45bad;">55</span><span style="color: #bc6ec5;">}</span>,
    <span style="color: #bc6ec5;">{</span><span style="color: #2d9574;">"name"</span>: <span style="color: #2d9574;">"Anthony Hopkins"</span>, <span style="color: #2d9574;">"age"</span>: <span style="color: #a45bad;">34</span><span style="color: #bc6ec5;">}</span>,
    <span style="color: #bc6ec5;">{</span><span style="color: #2d9574;">"name"</span>: <span style="color: #2d9574;">"Martin Godzilla"</span>, <span style="color: #2d9574;">"age"</span>: <span style="color: #a45bad;">67</span><span style="color: #bc6ec5;">}</span>,
    <span style="color: #bc6ec5;">{</span><span style="color: #2d9574;">"name"</span>: <span style="color: #2d9574;">"Tony Jabroney"</span>, <span style="color: #2d9574;">"age"</span>: <span style="color: #a45bad;">21</span><span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">]</span>

<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">create_customer_over_50_file</span><span style="color: #4f97d7;">()</span>:
    <span style="color: #7590db;">customers</span> = CUSTOMERS_DB

    <span style="color: #4f97d7; font-weight: bold;">with</span> <span style="color: #4f97d7;">open</span><span style="color: #4f97d7;">(</span><span style="color: #2d9574;">'../output/customers_over_50_report.txt'</span>, <span style="color: #2d9574;">'w'</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7; font-weight: bold;">as</span> <span style="color: #7590db;">writer</span>:
        customers_over_50 = <span style="color: #4f97d7;">list</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7;">filter</span><span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">(</span><span style="color: #4f97d7; font-weight: bold;">lambda</span> customer: customer<span style="color: #67b11d;">[</span><span style="color: #2d9574;">'age'</span><span style="color: #67b11d;">]</span> &gt; <span style="color: #a45bad;">50</span><span style="color: #2d9574;">)</span>, customers<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>

        <span style="color: #4f97d7; font-weight: bold;">for</span> customer <span style="color: #4f97d7; font-weight: bold;">in</span> customers_over_50:
            writer.write<span style="color: #4f97d7;">(</span>f<span style="color: #2d9574;">'</span>{customer["name"]}<span style="color: #2d9574;">, </span>{ customer["age"]}<span style="color: #2d9574;">\n'</span><span style="color: #4f97d7;">)</span>

create_customer_over_50_file<span style="color: #4f97d7;">()</span>
</pre>
</div>

<p>
This code accomplishes a fairly common set of tasks:
</p>
<ul class="org-ul">
<li>Reads data from some data source</li>
<li>Filters that data based on a business requirement.</li>
<li>Writes it to an output destination</li>
</ul>

<p>
Regardless of whether or not you're connecting to a database, reading from an API, or streaming that data into a DLQ, the general principles remain. We access data, transform it, and output it.
</p>

<p>
The above is nicely written. Generally, whomever wrote this function could feel pretty confident that it does what they want based on reading it. For many years, I wrote code just like this, and I would test it by manually reading the output data, and calling it done. Customer over 50 report is ready for prod, boss.
</p>

<p>
But now comes a new requirement: we must achieve over 80% of the lines of code covered by a unit test in order to ship it.
</p>

<p>
No problem, you think. We could run this function, and then write another function to validate. Job done, with the following code:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> os

<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">validate_customer_over_50_file_exists</span><span style="color: #4f97d7;">()</span>:
    <span style="color: #7590db;">path</span> = <span style="color: #2d9574;">'../output/customers_over_50_report.txt'</span>
    <span style="color: #4f97d7; font-weight: bold;">assert</span> os.path.isfile<span style="color: #4f97d7;">(</span>path<span style="color: #4f97d7;">)</span>, <span style="color: #2d9574;">"Path should exist"</span>

<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">validate_customer_over_50_file</span><span style="color: #4f97d7;">()</span>:
    <span style="color: #4f97d7; font-weight: bold;">with</span> <span style="color: #4f97d7;">open</span><span style="color: #4f97d7;">(</span><span style="color: #2d9574;">'../output/customers_over_50_report.txt'</span>, <span style="color: #2d9574;">'r'</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7; font-weight: bold;">as</span> <span style="color: #7590db;">reader</span>:
        line = reader.readline<span style="color: #4f97d7;">()</span>
        <span style="color: #4f97d7; font-weight: bold;">while</span> line != <span style="color: #2d9574;">''</span>:
            <span style="color: #7590db;">record</span> = line.split<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">','</span><span style="color: #4f97d7;">)</span>
            <span style="color: #7590db;">record</span> = <span style="color: #4f97d7;">[</span>v.strip<span style="color: #bc6ec5;">()</span> <span style="color: #4f97d7; font-weight: bold;">for</span> v <span style="color: #4f97d7; font-weight: bold;">in</span> record<span style="color: #4f97d7;">]</span>
            <span style="color: #4f97d7; font-weight: bold;">assert</span> <span style="color: #4f97d7;">int</span><span style="color: #4f97d7;">(</span>record<span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">1</span><span style="color: #bc6ec5;">]</span><span style="color: #4f97d7;">)</span> &gt; <span style="color: #a45bad;">50</span>, <span style="color: #2d9574;">"Customer should be over 50"</span>

            <span style="color: #7590db;">line</span>=reader.readline<span style="color: #4f97d7;">()</span>

validate_customer_over_50_file_exists<span style="color: #4f97d7;">()</span>
validate_customer_over_50_file<span style="color: #4f97d7;">()</span>
</pre>
</div>

<p>
In some contexts, I'd see the above and would think&#x2026; just ship it. It's not awful. It has asserts which make sense at least. In my time at the university, this already exceeds any automated test I'd ever written (none).
</p>

<p>
But alas, at major software engineering organizations, this doesn't really fly.
</p>

<p>
Here's where it starts to break down for me:
</p>
<ul class="org-ul">
<li>Separation of Responsibility / Concerns
It's hard to detect in this short snippet, but recall there's 3 separate operations going on. There's the input, the business logic, and the output. They're all mixed together. Any of the 3 can evolve at any time. There's times when from a computer architecture perspective, we're leaving the main execution, and we're waiting on I/O processes to complete.</li>
<li>Maintainability
Requirements change. One day, you're reading data from an in-memory source, but the next you're fetching it from a microservice. One day, it's customers over 50, the next, it's customers between the ages of 25 and 55 in California. One day, you're writing it to a flat file, but the next you're sending it to an API. In some cases, 100% of this code would be re-written.
<ul class="org-ul">
<li>Reusability
What if we need a second report. Much of the requirements are the same, but this time we're writing products to a CSV, and filtering by price. In the current design of this code, we would write a second, completely separate but eerily similiar function. And it would need all it's own unit tests.</li>
</ul></li>
</ul>

<p>
You get the idea. It's not bad code, it's just not particularly <i>good</i> code either.
</p>

<p>
So what do we do? We refactor and abstract. This is where unit tests in some ways begin to drive our codebase architecture. When we develop code with unit tests in mind, the code is better organized, more reusable, and easier to maintain. My first boss at my new company once said, "Programming gets fun when you stop coding and start engineering". My eyes rolled all the way back into my head when he said that, but he was right.
</p>
</div>
</div>
