org/2023-06-16-Testing.org
** Refactoring for organization, maintainenace, and resuability
Recall that we are doing 3 primary things: fetching data, transforming it, and outputing it. These will form the basis for our refactor.

So, we'll write 3 classes which specialize in these areas. The first will be the CustomerRepository. It's sole purpose will be to surface customer data. The second will be the CustomerService, which is our business logic. This is where we'll implement what HR says they need -- for example, the filter for the customer age, and the string output format they require. Lastly, we'll write a FileWriter, whose sole job is to write data to files.

It is like follows:

#+BEGIN_SRC python
# refactoring our code

# stores and returns data
class CustomerRepository:
    def __init__(self):
        pass

    def get_customers(self):
        return [
            {"name": "Jennifer Love Hewitt", "age": 55},
            {"name": "Anthony Hopkins", "age": 34},
            {"name": "Martin Godzilla", "age": 67},
            {"name": "Tony Jabroney", "age": 21}
        ]

# data interactions
class CustomerService:
    def __init__(self):
        pass

    def filter_customers(self, customers):
        return list(filter((lambda customer: customer['age'] > 50), customers))

    def get_customer_record_format(self, customer):
        return f'{customer["name"]}, { customer["age"]}\n'

# writes to files
class FileWriter():
    def __init__(self):
        pass

    def write_file(self, file_name, contents):
        with open(file_name, 'w') as writer:
            for line in contents:
                writer.write(line)

def main(customer_repository, customer_service, file_writer):
    customers = customer_repository.get_customers()
    customers_over_50 = customer_service.filter_customers(customers)
    formatted_customers_over_50 = [customer_service.get_customer_record_format(customer) for customer in customers_over_50]
    file_writer.write_file("../output/customers_over_50_report.txt", formatted_customers_over_50)

main(CustomerRepository(), CustomerService(), FileWriter())
validate_customer_over_50_file_exists()
validate_customer_over_50_file()
#+END_SRC 

... and we can even re-use our old unit tests to check our work!

This is a lot more code. We've effectively split the original code into its component parts. But each part is now reusable, easier to maintain, and easier to test. Let's take a look at those unit tests:

#+BEGIN_SRC python
def test_customer_repository(customer_repository):
    customers = customer_repository.get_customers()

    for customer in customers:
        assert customer["name"] != None and customer["age"] != None


def test_customer_service_filter(customer_service):
    customers = [
        {"name": "Jennifer Love Hewitt", "age": 55},
        {"name": "Anthony Hopkins", "age": 34},
    ]

    filtered_customers = customer_service.filter_customers(customers)

    assert len(filtered_customers) == 1

    for customer in filtered_customers:
        assert customer["age"] > 50


def test_customer_service_record_format(customer_service):
    customers = {"name": "Jennifer Love Hewitt", "age": 55}

    formatted_customer = customer_service.get_customer_record_format(customers)

    assert formatted_customer == "Jennifer Love Hewitt, 55", f"Should be like a CSV, but instead is {formatted_customer}"


test_customer_repository(CustomerRepository())
test_customer_service_filter(CustomerService())
test_customer_service_record_format(CustomerService())
#+END_SRC

Each component is now tested separately. Each test is simple. The components are isolated. The unit tests test only one function at a time. But you may ask: where is the unit test for the FileWriter?

Here's the difficulty with the FileWriter. The FileWriter leaves our code. It necessarily engages in some sort of File I/O that takes palce separately from the exceution of our application. In unit tests, we have a rule: we don't leave the function we're testing.

To avoid this in unit tests, we use mocks. Mocking can be done in any language, but in python we commonly use ~unittest.mock~. Instead of opening a real file, we'll use ~mock_open~ and open a Mock file. Then we'll validate that our code does that correctly, and writes to that mock correctly -- but we won't actually write a file.

Isn't that bad? Not really -- at that point, it's executing code we didn't write. If an issue is found at that point, we'll open an Issue with the Python language folks. Here's what it looks like:

#+BEGIN_SRC python
from unittest.mock import patch, mock_open

def test_file_writer():
    file_writer = FileWriter()
    open_mock = mock_open()

    with patch("__main__.open", open_mock, create=True):
        file_writer.write_file("../output/test.txt", ["my-data"])

    open_mock.assert_called_once_with("../output/test.txt", "w")
    open_mock.return_value.write.assert_called_once_with("my-data\n")

test_file_writer()
#+END_SRC

In the above unit tests, we are using a mock to patch a function. In this case, we patch the ~open~ function with a new variable, ~open_mock~. This tells python, instead of calling ~open~ and creating a file, call our ~open_mock~ object instead. This is also how we build our asserts, since Python is monitoring the uses of ~open_mock~. We can therefore assert that it's called exactly once, and that we call it with ~my-data\n~, thereby enforcing our contract.

