_posts/2023-06-16-Testing.html

<div id="outline-container-org20ec363" class="outline-3">
<h3 id="org20ec363"><span class="section-number-3">2.2.</span> Refactoring for organization, maintainenace, and resuability</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Recall that we are doing 3 primary things: fetching data, transforming it, and outputing it. These will form the basis for our refactor.
</p>

<p>
So, we'll write 3 classes which specialize in these areas. The first will be the CustomerRepository. It's sole purpose will be to surface customer data. The second will be the CustomerService, which is our business logic. This is where we'll implement what HR says they need &#x2013; for example, the filter for the customer age, and the string output format they require. Lastly, we'll write a FileWriter, whose sole job is to write data to files.
</p>

<p>
It is like follows:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">refactoring our code</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">stores and returns data</span>
<span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">CustomerRepository</span>:
    <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">__init__</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">self</span><span style="color: #4f97d7;">)</span>:
        <span style="color: #4f97d7; font-weight: bold;">pass</span>

    <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">get_customers</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">self</span><span style="color: #4f97d7;">)</span>:
        <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #4f97d7;">[</span>
            <span style="color: #bc6ec5;">{</span><span style="color: #2d9574;">"name"</span>: <span style="color: #2d9574;">"Jennifer Love Hewitt"</span>, <span style="color: #2d9574;">"age"</span>: <span style="color: #a45bad;">55</span><span style="color: #bc6ec5;">}</span>,
            <span style="color: #bc6ec5;">{</span><span style="color: #2d9574;">"name"</span>: <span style="color: #2d9574;">"Anthony Hopkins"</span>, <span style="color: #2d9574;">"age"</span>: <span style="color: #a45bad;">34</span><span style="color: #bc6ec5;">}</span>,
            <span style="color: #bc6ec5;">{</span><span style="color: #2d9574;">"name"</span>: <span style="color: #2d9574;">"Martin Godzilla"</span>, <span style="color: #2d9574;">"age"</span>: <span style="color: #a45bad;">67</span><span style="color: #bc6ec5;">}</span>,
            <span style="color: #bc6ec5;">{</span><span style="color: #2d9574;">"name"</span>: <span style="color: #2d9574;">"Tony Jabroney"</span>, <span style="color: #2d9574;">"age"</span>: <span style="color: #a45bad;">21</span><span style="color: #bc6ec5;">}</span>
        <span style="color: #4f97d7;">]</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">data interactions</span>
<span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">CustomerService</span>:
    <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">__init__</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">self</span><span style="color: #4f97d7;">)</span>:
        <span style="color: #4f97d7; font-weight: bold;">pass</span>

    <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">filter_customers</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">self</span>, customers<span style="color: #4f97d7;">)</span>:
        <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #4f97d7;">list</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7;">filter</span><span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">(</span><span style="color: #4f97d7; font-weight: bold;">lambda</span> customer: customer<span style="color: #67b11d;">[</span><span style="color: #2d9574;">'age'</span><span style="color: #67b11d;">]</span> &gt; <span style="color: #a45bad;">50</span><span style="color: #2d9574;">)</span>, customers<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>

    <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">get_customer_record_format</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">self</span>, customer<span style="color: #4f97d7;">)</span>:
        <span style="color: #4f97d7; font-weight: bold;">return</span> f<span style="color: #2d9574;">'</span>{customer["name"]}<span style="color: #2d9574;">, </span>{ customer["age"]}<span style="color: #2d9574;">\n'</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">writes to files</span>
<span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">FileWriter</span><span style="color: #4f97d7;">()</span>:
    <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">__init__</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">self</span><span style="color: #4f97d7;">)</span>:
        <span style="color: #4f97d7; font-weight: bold;">pass</span>

    <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">write_file</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">self</span>, file_name, contents<span style="color: #4f97d7;">)</span>:
        <span style="color: #4f97d7; font-weight: bold;">with</span> <span style="color: #4f97d7;">open</span><span style="color: #4f97d7;">(</span>file_name, <span style="color: #2d9574;">'w'</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7; font-weight: bold;">as</span> <span style="color: #7590db;">writer</span>:
            <span style="color: #4f97d7; font-weight: bold;">for</span> line <span style="color: #4f97d7; font-weight: bold;">in</span> contents:
                writer.write<span style="color: #4f97d7;">(</span>line<span style="color: #4f97d7;">)</span>

<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">main</span><span style="color: #4f97d7;">(</span>customer_repository, customer_service, file_writer<span style="color: #4f97d7;">)</span>:
    customers = customer_repository.get_customers<span style="color: #4f97d7;">()</span>
    <span style="color: #7590db;">customers_over_50</span> = customer_service.filter_customers<span style="color: #4f97d7;">(</span>customers<span style="color: #4f97d7;">)</span>
    <span style="color: #7590db;">formatted_customers_over_50</span> = <span style="color: #4f97d7;">[</span>customer_service.get_customer_record_format<span style="color: #bc6ec5;">(</span>customer<span style="color: #bc6ec5;">)</span> <span style="color: #4f97d7; font-weight: bold;">for</span> customer <span style="color: #4f97d7; font-weight: bold;">in</span> customers_over_50<span style="color: #4f97d7;">]</span>
    file_writer.write_file<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"../output/customers_over_50_report.txt"</span>, formatted_customers_over_50<span style="color: #4f97d7;">)</span>

main<span style="color: #4f97d7;">(</span>CustomerRepository<span style="color: #bc6ec5;">()</span>, CustomerService<span style="color: #bc6ec5;">()</span>, FileWriter<span style="color: #bc6ec5;">()</span><span style="color: #4f97d7;">)</span>
validate_customer_over_50_file_exists<span style="color: #4f97d7;">()</span>
validate_customer_over_50_file<span style="color: #4f97d7;">()</span>
</pre>
</div>

<p>
&#x2026; and we can even re-use our old unit tests to check our work!
</p>

<p>
This is a lot more code. We've effectively split the original code into its component parts. But each part is now reusable, easier to maintain, and easier to test. Let's take a look at those unit tests:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">test_customer_repository</span><span style="color: #4f97d7;">(</span>customer_repository<span style="color: #4f97d7;">)</span>:
    <span style="color: #7590db;">customers</span> = customer_repository.get_customers<span style="color: #4f97d7;">()</span>

    <span style="color: #4f97d7; font-weight: bold;">for</span> customer <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #7590db;">customers</span>:
        <span style="color: #4f97d7; font-weight: bold;">assert</span> customer<span style="color: #4f97d7;">[</span><span style="color: #2d9574;">"name"</span><span style="color: #4f97d7;">]</span> != <span style="color: #a45bad;">None</span> <span style="color: #4f97d7; font-weight: bold;">and</span> customer<span style="color: #4f97d7;">[</span><span style="color: #2d9574;">"age"</span><span style="color: #4f97d7;">]</span> != <span style="color: #a45bad;">None</span>


<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">test_customer_service_filter</span><span style="color: #4f97d7;">(</span>customer_service<span style="color: #4f97d7;">)</span>:
    <span style="color: #7590db;">customers</span> = <span style="color: #4f97d7;">[</span>
        <span style="color: #bc6ec5;">{</span><span style="color: #2d9574;">"name"</span>: <span style="color: #2d9574;">"Jennifer Love Hewitt"</span>, <span style="color: #2d9574;">"age"</span>: <span style="color: #a45bad;">55</span><span style="color: #bc6ec5;">}</span>,
        <span style="color: #bc6ec5;">{</span><span style="color: #2d9574;">"name"</span>: <span style="color: #2d9574;">"Anthony Hopkins"</span>, <span style="color: #2d9574;">"age"</span>: <span style="color: #a45bad;">34</span><span style="color: #bc6ec5;">}</span>,
    <span style="color: #4f97d7;">]</span>

    <span style="color: #7590db;">filtered_customers</span> = customer_service.filter_customers<span style="color: #4f97d7;">(</span>customers<span style="color: #4f97d7;">)</span>

    <span style="color: #4f97d7; font-weight: bold;">assert</span> <span style="color: #4f97d7;">len</span><span style="color: #4f97d7;">(</span>filtered_customers<span style="color: #4f97d7;">)</span> == <span style="color: #a45bad;">1</span>

    <span style="color: #4f97d7; font-weight: bold;">for</span> customer <span style="color: #4f97d7; font-weight: bold;">in</span> filtered_customers:
        <span style="color: #4f97d7; font-weight: bold;">assert</span> customer<span style="color: #4f97d7;">[</span><span style="color: #2d9574;">"age"</span><span style="color: #4f97d7;">]</span> &gt; <span style="color: #a45bad;">50</span>


<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">test_customer_service_record_format</span><span style="color: #4f97d7;">(</span>customer_service<span style="color: #4f97d7;">)</span>:
    <span style="color: #7590db;">customers</span> = <span style="color: #4f97d7;">{</span><span style="color: #2d9574;">"name"</span>: <span style="color: #2d9574;">"Jennifer Love Hewitt"</span>, <span style="color: #2d9574;">"age"</span>: <span style="color: #a45bad;">55</span><span style="color: #4f97d7;">}</span>

    <span style="color: #7590db;">formatted_customer</span> = customer_service.get_customer_record_format<span style="color: #4f97d7;">(</span>customers<span style="color: #4f97d7;">)</span>

    <span style="color: #4f97d7; font-weight: bold;">assert</span> formatted_customer == <span style="color: #2d9574;">"Jennifer Love Hewitt, 55"</span>, f<span style="color: #2d9574;">"Should be like a CSV, but instead is </span>{formatted_customer}<span style="color: #2d9574;">"</span>


test_customer_repository<span style="color: #4f97d7;">(</span>CustomerRepository<span style="color: #bc6ec5;">()</span><span style="color: #4f97d7;">)</span>
test_customer_service_filter<span style="color: #4f97d7;">(</span>CustomerService<span style="color: #bc6ec5;">()</span><span style="color: #4f97d7;">)</span>
test_customer_service_record_format<span style="color: #4f97d7;">(</span>CustomerService<span style="color: #bc6ec5;">()</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<p>
Each component is now tested separately. Each test is simple. The components are isolated. The unit tests test only one function at a time. But you may ask: where is the unit test for the FileWriter?
</p>

<p>
Here's the difficulty with the FileWriter. The FileWriter leaves our code. It necessarily engages in some sort of File I/O that takes palce separately from the exceution of our application. In unit tests, we have a rule: we don't leave the function we're testing.
</p>

<p>
To avoid this in unit tests, we use mocks. Mocking can be done in any language, but in python we commonly use <code>unittest.mock</code>. Instead of opening a real file, we'll use <code>mock_open</code> and open a Mock file. Then we'll validate that our code does that correctly, and writes to that mock correctly &#x2013; but we won't actually write a file.
</p>

<p>
Isn't that bad? Not really &#x2013; at that point, it's executing code we didn't write. If an issue is found at that point, we'll open an Issue with the Python language folks. Here's what it looks like:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">from</span> unittest.mock <span style="color: #4f97d7; font-weight: bold;">import</span> patch, mock_open

<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">test_file_writer</span><span style="color: #4f97d7;">()</span>:
    <span style="color: #7590db;">file_writer</span> = FileWriter<span style="color: #4f97d7;">()</span>
    <span style="color: #7590db;">open_mock</span> = mock_open<span style="color: #4f97d7;">()</span>

    <span style="color: #4f97d7; font-weight: bold;">with</span> patch<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"__main__.open"</span>, open_mock, create=<span style="color: #a45bad;">True</span><span style="color: #4f97d7;">)</span>:
        file_writer.write_file<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"../output/test.txt"</span>, <span style="color: #bc6ec5;">[</span><span style="color: #2d9574;">"my-data"</span><span style="color: #bc6ec5;">]</span><span style="color: #4f97d7;">)</span>

    open_mock.assert_called_once_with<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"../output/test.txt"</span>, <span style="color: #2d9574;">"w"</span><span style="color: #4f97d7;">)</span>
    open_mock.return_value.write.assert_called_once_with<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"my-data\n"</span><span style="color: #4f97d7;">)</span>

test_file_writer<span style="color: #4f97d7;">()</span>
</pre>
</div>

<p>
In the above unit tests, we are using a mock to patch a function. In this case, we patch the <code>open</code> function with a new variable, <code>open_mock</code>. This tells python, instead of calling <code>open</code> and creating a file, call our <code>open_mock</code> object instead. This is also how we build our asserts, since Python is monitoring the uses of <code>open_mock</code>. We can therefore assert that it's called exactly once, and that we call it with <code>my-data\n</code>, thereby enforcing our contract.
</p>
</div>
</div>
