org/2023-06-16-Testing.org
** Additional powers of abstraction
In each of these cases, our CustomerRepository, CustomerService, and FileWriter, we're abstracting away the details. The main function is dependent on these external classes, but it's agnostic toward the implementation details. For example, the main() function doesn't care what happens inside the CustomerRepository, main just cares that it gets data back in the format it requires. It doesn't care what format the CustomerService prints customers in, just that it returns a list of strings.

This leads to some powerful capabilities, namely in the customization of code. For example, what if the CustomerRepository was no longer stored in memory, but instead became a database. Well, there would be no changes to main. As long as the database driver implements a CustomerRepository, containing the function get_customers, it can be anything it wants to be. It can ready from a file, it can fetch from an API... main doesn't care. Main will work all the same.

In much the same way any CD can be inserted into a disc drive, any CustomerRepository can be inserted into main.

This is subsequently where mocks can and will come back into play. Let's say CustomerRepository turns into a full-fledged cloud-provided database. In unit tests, we no longer want to make the actual database call. So, we'll pass in a Mock for those aspects of the call to get_customers, much the same way we did with ~open~. 

* User Acceptance Tests
* Contract Testing
* Integration Tests


