_posts/2023-06-16-Testing.html

<div id="outline-container-orgc2f0bd2" class="outline-3">
<h3 id="orgc2f0bd2"><span class="section-number-3">2.3.</span> Additional powers of abstraction</h3>
<div class="outline-text-3" id="text-2-3">
<p>
In each of these cases, our CustomerRepository, CustomerService, and FileWriter, we're abstracting away the details. The main function is dependent on these external classes, but it's agnostic toward the implementation details. For example, the main() function doesn't care what happens inside the CustomerRepository, main just cares that it gets data back in the format it requires. It doesn't care what format the CustomerService prints customers in, just that it returns a list of strings.
</p>

<p>
This leads to some powerful capabilities, namely in the customization of code. For example, what if the CustomerRepository was no longer stored in memory, but instead became a database. Well, there would be no changes to main. As long as the database driver implements a CustomerRepository, containing the function get<sub>customers</sub>, it can be anything it wants to be. It can ready from a file, it can fetch from an API&#x2026; main doesn't care. Main will work all the same.
</p>

<p>
In much the same way any CD can be inserted into a disc drive, any CustomerRepository can be inserted into main.
</p>

<p>
This is subsequently where mocks can and will come back into play. Let's say CustomerRepository turns into a full-fledged cloud-provided database. In unit tests, we no longer want to make the actual database call. So, we'll pass in a Mock for those aspects of the call to get<sub>customers</sub>, much the same way we did with <code>open</code>. 
</p>
</div>
</div>
</div>

<div id="outline-container-org890c184" class="outline-2">
<h2 id="org890c184"><span class="section-number-2">3.</span> User Acceptance Tests</h2>
</div>
<div id="outline-container-org85a6344" class="outline-2">
<h2 id="org85a6344"><span class="section-number-2">4.</span> Contract Testing</h2>
</div>
<div id="outline-container-orgbb89c54" class="outline-2">
<h2 id="orgbb89c54"><span class="section-number-2">5.</span> Integration Tests</h2>
</div>
